## Task 1: Read data from csv file into a pandas dataframe

You are given two files of data. Begin with the first file, which contains the three states with the most observations (rows): California, Texas, and Pennsylvania.

### 1a: Import statements

Import numpy and pandas. Use their standard aliases.

In [1]:
import numpy as np
import pandas as pd

In [2]:
# 1. ### YOUR CODE HERE ###
top3 = pd.read_csv('epa_ca_tx_pa.csv')

# 2. ### YOUR CODE HERE ###
top3.head()

   state_code  state_name  county_code county_name   aqi
0           6  California            1     Alameda  11.0
1           6  California            7       Butte   6.0
2           6  California           19      Fresno  11.0
3           6  California           29        Kern   7.0
4           6  California           29        Kern   3.0

In [3]:
top3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 546 entries, 0 to 545
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   state_code   546 non-null    int64
 1   state_name   546 non-null    object
 2   county_code  546 non-null    int64
 3   county_name  546 non-null    object
 4   aqi          546 non-null    float64
dtypes: float64(1), int64(2), object(2)
memory usage: 21.5+ KB

<details>
  <summary><h4><strong>Hint</strong></h4></summary>

The `info()` method returns a dataframe's metadata.

</details>

### 2b: Summary statistics

Examine the summary statistics of the dataframe's numeric columns. The output should be a table that includes row count, mean, standard deviation, min, max, and quartile values.

In [4]:
top3.describe()

       state_code  county_code         aqi
count  546.000000   546.000000  546.000000
mean    20.593407    83.179487    8.906593
std     19.001484    92.240873    9.078479
min      6.000000     1.000000    0.000000
25%      6.000000    29.000000    3.000000
50%      6.000000    66.000000    6.000000
75%     42.000000    98.500000   11.000000
max     48.000000   479.000000   93.000000

## Task 3: Explore your data

Practice exploring your data by completing the following exercises.

### 3a: Rows per state

Select the `state_name` column and use the `value_counts()` method on it to check how many rows there are for each state in the dataframe.

In [5]:
top3['state_name'].value_counts()

California      342
Texas           104
Pennsylvania    100
Name: state_name, dtype: int64

In [6]:
top3_sorted = top3.sort_values(by='aqi', ascending=False)

top3_sorted.head(10)

     state_code  state_name  county_code    county_name   aqi
76            6  California           37    Los Angeles  93.0
146           6  California           37    Los Angeles  59.0
41            6  California           83  Santa Barbara  47.0
122           6  California           59         Orange  47.0
184           6  California           59         Orange  47.0
51           48       Texas          141        El Paso  47.0
80            6  California           65      Riverside  43.0
136          48       Texas          141        El Paso  40.0
58            6  California           65      Riverside  40.0
91           48       Texas          141        El Paso  40.0

### 3c: Use `iloc` to select rows

Use `iloc` to select the two rows at indices 10 and 11 of the `top3_sorted` dataframe.

In [7]:
top3_sorted.iloc[10:12]

     state_code  state_name  county_code  county_name   aqi
186           6  California           73    San Diego  39.0
74            6  California           37  Los Angeles  38.0

### 4a: Basic Boolean masking

1. Create a Boolean mask that selects only the observations of the `top3_sorted` dataframe that are from California.
2. Apply the Boolean mask to the `top3_sorted` dataframe and assign the result to a variable called `ca_df`.
3. Print the first five rows of `ca_df`.

In [8]:
mask = top3_sorted['state_name'] == 'California'
ca_df = top3_sorted[mask]
ca_df.head()

     state_code  state_name  county_code    county_name   aqi
76            6  California           37    Los Angeles  93.0
146           6  California           37    Los Angeles  59.0
41            6  California           83  Santa Barbara  47.0
122           6  California           59         Orange  47.0
184           6  California           59         Orange  47.0

### 4b: Validate CA data

Inspect the shape of your new `ca_df` dataframe. Does its row count match the number of California rows determined in Task 3a?

In [9]:
ca_df.shape

(342, 5)

### 4c: Rows per CA county

Examine a list of the number of times each county is represented in the California data.

In [10]:
ca_df['county_name'].value_counts()

Los Angeles        55
Santa Barbara      26
San Bernardino     21
Orange             19
San Diego          19
Sacramento         17
Alameda            17
Fresno             16
Riverside          14
Contra Costa       13
Imperial           13
San Francisco       8
Monterey            8
Humboldt            8
Santa Clara         7
El Dorado           7
Placer              6
Butte               6
Kern                6
Mendocino           6
Solano              5
San Joaquin         5
Tulare              5
Ventura             5
Sutter              4
San Mateo           4
Marin               3
Sonoma              3
Stanislaus          3
San Luis Obispo     2
Napa                2
Santa Cruz          2
Calaveras           2
Shasta              1
Tuolumne            1
Inyo                1
Yolo                1
Mono                1
Name: county_name, dtype: int64

### 4d: Calculate mean AQI for Los Angeles county

You notice that Los Angeles county has more than twice the number of rows of the next-most-represented county in California, and you want to learn more about it.

*  Calculate the mean AQI for LA county.

In [11]:
mask = ca_df['county_name'] == 'Los Angeles'
ca_df[mask]['aqi'].mean()

13.4

## Task 5: Groupby

Group the original dataframe (`top3`) by state and calculate the mean AQI for each state.

In [12]:
top3.groupby('state_name').mean()[['aqi']]

                   aqi
state_name
California    9.412281
Pennsylvania  6.690000
Texas         9.375000

## Task 6: Add more data

Now that you have performed a short examination of the file with AQI data for California, Texas, and Pennsylvania, you want to add more data from your second file.

### 6a: Read in the second file

1. Read in the data for the remaining territories. The file is called `'epa_others.csv'` and is already in your working directory. Assign the resulting dataframe to a variable named `other_states`.

2. Use the `head()` method on the `other_states` dataframe to inspect the first five rows.

In [13]:
other_states = pd.read_csv('epa_others.csv')
other_states.head()

   state_code state_name  county_code county_name   aqi
0           4    Arizona           13    Maricopa  18.0
1           4    Arizona           13    Maricopa   9.0
2           4    Arizona           19        Pima  20.0
3           8   Colorado           41     El Paso   9.0
4          12    Florida           31       Duval  15.0

### 6b: Concatenate the data

The data from `other_states` is in the same format as the data from `top3`. It has the same columns in the same order.

1. Add the data from `other_states` as new rows beneath the data from `top3`. Assign the result to a new dataframe called `combined_df`.

2. Verify that the length of `combined_df` is equal to the sum of the lengths of `top3` and `other_states`.

In [14]:
combined_df = pd.concat([top3, other_states], axis=0)
len(combined_df) == len(top3) + len(other_states)

True

## Task 7: Complex Boolean masking

According to the EPA, AQI values of 51-100 are considered of "Moderate" concern. You've been tasked with examining some data for the state of Washington.

*  Use Boolean masking to return the rows that represent data from the state of Washington with AQI values of 51+.

In [15]:
mask = (combined_df['state_name'] == 'Washington') & (combined_df['aqi'] >= 51)
combined_df[mask]

     state_code  state_name  county_code county_name   aqi
40           53  Washington           33        King  55.0
82           53  Washington           61   Snohomish  76.0
121          53  Washington           77      Yakima  58.0
122          53  Washington           77      Yakima  57.0

Pandas is a powerful tool in Python for handling data. It has built-in functions and tools made for working with tables. It makes tasks like reading/writing files, getting summary statistics, and manipulating data easy. Powered by NumPy, it boosts performance using array operations. The interface is user-friendly, letting you see and work with your data in rows and columns.ur response.